# عمليات المنطقية

# و (and): تحقق من تحقق شرطين معًا لتكون النتيجة صحيحة
x = 5
y = 3
result_and = (x > 2) and (y < 4)
print("نتيجة عملية الو (and):", result_and)  # النتيجة ستكون صحيحة True لأن كلا الشروط صحيحة

# أو (or): يتحقق إذا كان أحد الشروط صحيحًا
a = 10
b = 7
result_or = (a == 10) or (b == 5)
print("نتيجة عملية الأو (or):", result_or)  # النتيجة ستكون صحيحة True لأن أحد الشروط صحيح

# ليس (not): يعكس القيمة المنطقية
c = True
result_not = not c
print("نتيجة عملية ليس (not):", result_not)  # النتيجة ستكون خطأ False لأنه تم عكس القيمة المنطقية
